import random
import string
"""
1. Выполнить логические побитовые операции «И», «ИЛИ» и др. над числами 5 и
6. Выполнить над числом 5 побитовый сдвиг вправо и влево на два знака.
"""

# a = 5
# b = 6
# print(a & b)
# print(a | b)
# print(a ^ b)
# print(~a)
# print(~b)
# print(a << 2)
# print(b >> 2)

"""
2. По введенным пользователем координатам двух точек вывести уравнение прямой 
вида y = kx + b, проходящей через эти точки.
"""
# x = int(input('Введите х первой точки: '))
# y = int(input('Введите y первой точки: '))
# x1 = int(input('Введите x второй точки: '))
# y1 = int(input('Введите y второй точки: '))
#
# if x - x1 != 0:
#     k = (y - y1) / (x - x1)
#     b = y1 - k * x1
#     if y == k * x + b:
#         print(f'Уравнение прямой y = {k}x + {b}')
#     else:
#         print('Такого не может быть! перепроверь введённые данные!')
# else:
#     print('Деление на 0! Некорректно введены данные! Попробуйте снова!')

"""
3. Написать программу, которая генерирует в указанных пользователем границах:
a. случайное целое число,
b. случайное вещественное число,
c. случайный символ.
Для каждого из трех случаев пользователь задает свои границы диапазона. Например, если надо получить случайный символ 
от 'a' до 'f', то вводятся эти символы. Программа должна вывести на экран любой символ алфавита от 'a' до 'f' 
включительно.
"""
# first_float_border = float(input('Введите первую цифру границы: '))
# second_float_border = float(input('Введите вторую цифру границы: '))
# first_int_border = int(input('Введите первую цифру границы: '))
# second_int_border = int(input('Введите вторую цифру границы: '))
# first_symbol_border = int(input('Введите первый символ границы: '))
# second_symbol_border = int(input('Введите второй символ границы: '))
#
# print(f'Случайное целое число: {random.randint(first_int_border, second_int_border)}')
# print(f'Случайное вещественное число: {random.uniform(first_float_border, second_float_border)}')
# print(f'Случайный символ: {chr(random.randint(first_symbol_border, second_symbol_border))}')

"""
4. Пользователь вводит две буквы. Определить, на каких местах алфавита они стоят, и сколько между ними находится букв.
"""
# a = input('Введите первую букву: ')
# b = input('Введите вторую букву: ')
# c = string.ascii_lowercase
# index_a = c.index(a) + 1
# index_b = c.index(b)
# i = index_b - index_a
#
# print(f'Положение первой буквы в алфавите: {index_a} \n'
#       f'Положение второй буквы в алфавите: {index_b} \n'
#       f'Количество букв между буквами:  {i}')

# """
# 5. Пользователь вводит номер буквы в алфавите. Определить, какая это буква.
# """
# a = int(input('Введите номер буквы алфавита: ')) - 1
# b = string.ascii_lowercase
# print(f'Буква алфавита, соответствующая введённой цифре: {b[a]}')
